class Scenario < ApplicationRecord

  attachment :scenario_image, destroy: false

  enum categories: {
    "シナリオを選択": 0,
    "クトゥルフ": 1,
    "パラノイア": 2,
    "インセイン": 3,
    "ソードワールド": 4,
    "アリアンロッド": 5,
    "ネクロニカ": 6,
    "ダブルクロス": 7,
    "ゆうやけこやけ": 8,
    "グランクレスト": 9,
    "D&amp;D": 10,
    "ログ・ホライズン": 11,
    "サタスペ": 12,
    "シノビガミ": 13,
    "モノトーンミュージアム": 14,
    "ビギニングアイドル": 15,
    "ウタカゼ": 16,
    "マギカロギア": 17,
    "ガーデンオーダー": 18,
    "ピーカーブー": 19,
    "鵺鏡": 20,
    "神話創世RPGアマデウス": 21,
    "ダークデイズドライブ": 22,
    "ヤンキー＆ヨグ=ソトース": 23,
    "フィアスコ": 24,
    "その他": 50
  }

  enum levels: {
    "難易度を選択": 0,
    "★": 1,
    "★★": 2,
    "★★★": 3,
    "★★★★": 4,
    "★★★★★": 5
  }

  enum upper_limit_counts: {
    "人数上限を選択": 0,
    "1人": 1,
    "2人": 2,
    "3人": 3,
    "4人": 4,
    "5人": 5,
    "6人": 6,
    "7人": 7,
    "8人": 8,
    "9人": 9,
    "上限なし": 10
  }, _suffix: :upper_limit_counts

  enum lower_limit_counts: {
    "人数下限を選択": 0,
    "1人": 1,
    "2人": 2,
    "3人": 3,
    "4人": 4,
    "5人": 5,
    "6人": 6,
    "7人": 7,
    "8人": 8,
    "9人": 9
  }, _suffix: :lower_limit_counts

    enum play_genres: {
      "プレイジャンルを選択": 0,
      "オンライン": 1,
      "オフライン": 2,
    }

    enum play_times: {
      "プレイ時間を選択": 0,
      "1時間": 1,
      "2時間": 2,
      "3時間": 3,
      "4時間": 4,
      "5時間": 5,
      "6時間": 6,
      "7時間": 7,
      "8時間以上": 8,
    }

end
